# !usr/bin/python3
# -*- coding: utf-8 -*-


'''
Напишите функцию, которая вычисляет сумму трех чисел и возвращает результат в основную ветку программы.
'''


def count_sum(a, b, c):
    result = a + b + c
    return result


print(count_sum(10, 20, 30))
